## Queries on songplays

In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
# Number of paid users who used Sparkify 
%sql select count(distinct user_id) from songplays where level='paid';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(22,)]

In [4]:
# Select location of paid users 
%sql select distinct(sp.user_id), location from songplays sp inner join users u on sp.user_id=u.user_id where sp.level='paid' order by sp.user_id;

 * postgresql://student:***@127.0.0.1/sparkifydb
22 rows affected.

[(15, 'Chicago-Naperville-Elgin, IL-IN-WI'),
 (16, 'Birmingham-Hoover, AL'),
 (20, 'New York-Newark-Jersey City, NY-NJ-PA'),
 (24, 'Lake Havasu City-Kingman, AZ'),
 (25, 'Marinette, WI-MI'),
 (29, 'Atlanta-Sandy Springs-Roswell, GA'),
 (30, 'San Jose-Sunnyvale-Santa Clara, CA'),
 (36, 'Janesville-Beloit, WI'),
 (42, 'New York-Newark-Jersey City, NY-NJ-PA'),
 (44, 'Waterloo-Cedar Falls, IA'),
 (49, 'San Francisco-Oakland-Hayward, CA'),
 (58, 'Augusta-Richmond County, GA-SC'),
 (65, 'Longview, TX'),
 (70, 'San Antonio-New Braunfels, TX'),
 (72, 'Detroit-Warren-Dearborn, MI'),
 (73, 'Tampa-St. Petersburg-Clearwater, FL'),
 (80, 'Portland-South Portland, ME'),
 (82, 'Atlanta-Sandy Springs-Roswell, GA'),
 (85, 'Red Bluff, CA'),
 (88, 'Sacramento--Roseville--Arden-Arcade, CA'),
 (95, 'Winston-Salem, NC'),
 (97, 'Lansing-East Lansing, MI')]

In [5]:
# Number of free users who used Sparkify 
%sql select count(distinct user_id) from songplays where level='free';

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(82,)]

In [8]:
# Select location of paid users 
%sql select distinct(sp.user_id), location from songplays sp inner join users u on sp.user_id=u.user_id where sp.level='free' order by sp.user_id limit 20;

 * postgresql://student:***@127.0.0.1/sparkifydb
20 rows affected.

[(2, 'Plymouth, IN'),
 (3, 'Saginaw, MI'),
 (4, 'Parkersburg-Vienna, WV'),
 (5, 'Detroit-Warren-Dearborn, MI'),
 (6, 'Atlanta-Sandy Springs-Roswell, GA'),
 (7, 'Chicago-Naperville-Elgin, IL-IN-WI'),
 (8, 'Phoenix-Mesa-Scottsdale, AZ'),
 (9, 'Eureka-Arcata-Fortuna, CA'),
 (10, 'Washington-Arlington-Alexandria, DC-VA-MD-WV'),
 (11, 'Elkhart-Goshen, IN'),
 (12, 'New York-Newark-Jersey City, NY-NJ-PA'),
 (13, 'London, KY'),
 (14, 'Red Bluff, CA'),
 (15, 'Chicago-Naperville-Elgin, IL-IN-WI'),
 (16, 'Birmingham-Hoover, AL'),
 (17, 'Chicago-Naperville-Elgin, IL-IN-WI'),
 (18, 'San Diego-Carlsbad, CA'),
 (19, 'New York-Newark-Jersey City, NY-NJ-PA'),
 (22, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD'),
 (23, 'Raleigh, NC')]

In [7]:
# What popular songs were played?
%sql select s.title, a.name from songs s inner join artists a on s.artist_id=a.artist_id where song_id in (select song_id from songplays group by song_id);

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Setanta matins', 'Elena')]

In [10]:
# Which artists are being played most
%sql select a.name from artists a where a.artist_id in (select distinct artist_id from songplays group by artist_id);

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Elena',)]